# 벌집
import sys
import math

# a1 = 초항, an = 마지막 항, n = 항의 개수
# 0, 6, 12, 18, 24, ...
# 2번째 차원의 마지막 숫자 : (0+6+6*2)+1
# x번째 차원의 마지막 숫자 : 3x^2 - 3x + 1
# 2번째 차원의 마지막 숫자 : 3*2*2 - 3*2 + 1 = 7
# 3x^2 - 3x + (1 - x) = 0

n = int(sys.stdin.readline().strip())
x = math.ceil((3 + math.sqrt(-3 + 12*n)) / 6)
print(x)

# 01 => 1
# 02 03 04 05 06 07 => 2
# 08 09 10 11 12 13 14 15 16 17 18 19 => 3
# 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 => 4
# 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 => 5